# InstanceBinding Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
InstanceBinding Members
InstanceBinding Class Constructors Methods Properties See Also
---
The InstanceBinding type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| InstanceBinding()()()() | Constructs an empty instance binding. |
| InstanceBinding(CategorySet) | Constructs an instance binding with the set of categories passed. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Causes the object to release immediately any resources it may be utilizing. (Inherited from APIObject.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Categories | Retrieve or set the categories to which a parameter definition will be bound. (Inherited from ElementBinding.) |
| IsReadOnly | Identifies if the object is read-only or modifiable. (Inherited from APIObject.) |

# See Also
InstanceBinding Class
Autodesk.Revit.DB Namespace